tutorials/multicomponentFluid/counterFlowFlame2D_GRI/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    note        "mesh decomposition control dictionary";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  12;

decomposer      hierarchical;

distributor     zoltan;
libs            ("libzoltanDecomp.so");

// distributor     parMetis;
// libs            ("libparMetisDecomp.so");

hierarchicalCoeffs
{
    n           (6 2 1);
    order       xyz;
}

zoltanCoeffs
{
    lb_method   rcb;
}

// ************************************************************************* //
